docs: clarify metrics visualization instructions. Removed unused file. (#1824)
Co-authored-by: Keiven Chang <keivenchang@users.noreply.github.com>
